; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_7_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 - counter
	)
  (:init
		(= (value c0) 4)
	(= (value c1) 47)
	(= (value c2) 19)
	(= (value c3) 91)
	(= (value c4) 18)
	(= (value c5) 75)
	(= (value c6) 68)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
		)
	)
)

; plan
1. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 3 of 6
2. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 3 of 6
3. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 3 of 6
4. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 3 of 6
5. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 3 of 6
6. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 3 of 6
7. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 3 of 6
8. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 3 of 6
9. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 3 of 6
10. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 3 of 6
11. (increment c6)
   changed: (value c6) from 68 to 72
   goals met: 3 of 6
12. (increment c6)
   changed: (value c6) from 72 to 76
   goals met: 4 of 6
13. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 4 of 6
14. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 4 of 6
15. (increment c4)
   changed: (value c4) from 18 to 26
   goals met: 4 of 6
16. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 4 of 6
17. (increment c4)
   changed: (value c4) from 26 to 35
   goals met: 4 of 6
18. (increment c4)
   changed: (value c4) from 35 to 44
   goals met: 4 of 6
19. (increment c4)
   changed: (value c4) from 44 to 53
   goals met: 4 of 6
20. (increment c4)
   changed: (value c4) from 53 to 62
   goals met: 4 of 6
21. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 4 of 6
22. (increment c4)
   changed: (value c4) from 62 to 72
   goals met: 4 of 6
23. (increment c4)
   changed: (value c4) from 72 to 82
   goals met: 3 of 6
24. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 3 of 6
25. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 3 of 6
26. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 3 of 6
27. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 3 of 6
28. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 3 of 6
29. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 3 of 6
30. (increment c2)
   changed: (value c2) from 19 to 25
   goals met: 3 of 6
31. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 3 of 6
32. (increment c2)
   changed: (value c2) from 25 to 32
   goals met: 3 of 6
33. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 3 of 6
34. (increment c2)
   changed: (value c2) from 32 to 40
   goals met: 3 of 6
35. (increment c2)
   changed: (value c2) from 40 to 48
   goals met: 4 of 6
36. (decrement c4)
   changed: (value c4) from 82 to 72
   goals met: 5 of 6
37. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 5 of 6
38. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 5 of 6
39. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 5 of 6
40. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 5 of 6
41. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 5 of 6
42. (increment c4)
   changed: (value c4) from 72 to 82
   goals met: 4 of 6
43. (decrement c3)
   changed: (value c3) from 91 to 86
   goals met: 4 of 6
44. (decrement c3)
   changed: (value c3) from 86 to 81
   goals met: 5 of 6
45. (decrement c4)
   changed: (value c4) from 82 to 72
   goals met: 5 of 6
46. (decrement c3)
   changed: (value c3) from 81 to 76
   goals met: 5 of 6
47. (decrement c3)
   changed: (value c3) from 76 to 71
   goals met: 6 of 6
